jminor717/Teensy-Coil-Gun/V3/PIC18F45_CoilGunController.X/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.8
        Device            :  PIC18F45Q10
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.36 and above
        MPLAB 	          :  MPLAB X 6.00	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set S1_in aliases
#define S1_in_TRIS                 TRISAbits.TRISA0
#define S1_in_LAT                  LATAbits.LATA0
#define S1_in_PORT                 PORTAbits.RA0
#define S1_in_WPU                  WPUAbits.WPUA0
#define S1_in_OD                   ODCONAbits.ODCA0
#define S1_in_ANS                  ANSELAbits.ANSELA0
#define S1_in_SetHigh()            do { LATAbits.LATA0 = 1; } while(0)
#define S1_in_SetLow()             do { LATAbits.LATA0 = 0; } while(0)
#define S1_in_Toggle()             do { LATAbits.LATA0 = ~LATAbits.LATA0; } while(0)
#define S1_in_GetValue()           PORTAbits.RA0
#define S1_in_SetDigitalInput()    do { TRISAbits.TRISA0 = 1; } while(0)
#define S1_in_SetDigitalOutput()   do { TRISAbits.TRISA0 = 0; } while(0)
#define S1_in_SetPullup()          do { WPUAbits.WPUA0 = 1; } while(0)
#define S1_in_ResetPullup()        do { WPUAbits.WPUA0 = 0; } while(0)
#define S1_in_SetPushPull()        do { ODCONAbits.ODCA0 = 0; } while(0)
#define S1_in_SetOpenDrain()       do { ODCONAbits.ODCA0 = 1; } while(0)
#define S1_in_SetAnalogMode()      do { ANSELAbits.ANSELA0 = 1; } while(0)
#define S1_in_SetDigitalMode()     do { ANSELAbits.ANSELA0 = 0; } while(0)

// get/set S2_in aliases
#define S2_in_TRIS                 TRISAbits.TRISA1
#define S2_in_LAT                  LATAbits.LATA1
#define S2_in_PORT                 PORTAbits.RA1
#define S2_in_WPU                  WPUAbits.WPUA1
#define S2_in_OD                   ODCONAbits.ODCA1
#define S2_in_ANS                  ANSELAbits.ANSELA1
#define S2_in_SetHigh()            do { LATAbits.LATA1 = 1; } while(0)
#define S2_in_SetLow()             do { LATAbits.LATA1 = 0; } while(0)
#define S2_in_Toggle()             do { LATAbits.LATA1 = ~LATAbits.LATA1; } while(0)
#define S2_in_GetValue()           PORTAbits.RA1
#define S2_in_SetDigitalInput()    do { TRISAbits.TRISA1 = 1; } while(0)
#define S2_in_SetDigitalOutput()   do { TRISAbits.TRISA1 = 0; } while(0)
#define S2_in_SetPullup()          do { WPUAbits.WPUA1 = 1; } while(0)
#define S2_in_ResetPullup()        do { WPUAbits.WPUA1 = 0; } while(0)
#define S2_in_SetPushPull()        do { ODCONAbits.ODCA1 = 0; } while(0)
#define S2_in_SetOpenDrain()       do { ODCONAbits.ODCA1 = 1; } while(0)
#define S2_in_SetAnalogMode()      do { ANSELAbits.ANSELA1 = 1; } while(0)
#define S2_in_SetDigitalMode()     do { ANSELAbits.ANSELA1 = 0; } while(0)

// get/set S3_in aliases
#define S3_in_TRIS                 TRISAbits.TRISA2
#define S3_in_LAT                  LATAbits.LATA2
#define S3_in_PORT                 PORTAbits.RA2
#define S3_in_WPU                  WPUAbits.WPUA2
#define S3_in_OD                   ODCONAbits.ODCA2
#define S3_in_ANS                  ANSELAbits.ANSELA2
#define S3_in_SetHigh()            do { LATAbits.LATA2 = 1; } while(0)
#define S3_in_SetLow()             do { LATAbits.LATA2 = 0; } while(0)
#define S3_in_Toggle()             do { LATAbits.LATA2 = ~LATAbits.LATA2; } while(0)
#define S3_in_GetValue()           PORTAbits.RA2
#define S3_in_SetDigitalInput()    do { TRISAbits.TRISA2 = 1; } while(0)
#define S3_in_SetDigitalOutput()   do { TRISAbits.TRISA2 = 0; } while(0)
#define S3_in_SetPullup()          do { WPUAbits.WPUA2 = 1; } while(0)
#define S3_in_ResetPullup()        do { WPUAbits.WPUA2 = 0; } while(0)
#define S3_in_SetPushPull()        do { ODCONAbits.ODCA2 = 0; } while(0)
#define S3_in_SetOpenDrain()       do { ODCONAbits.ODCA2 = 1; } while(0)
#define S3_in_SetAnalogMode()      do { ANSELAbits.ANSELA2 = 1; } while(0)
#define S3_in_SetDigitalMode()     do { ANSELAbits.ANSELA2 = 0; } while(0)

// get/set S4_in aliases
#define S4_in_TRIS                 TRISAbits.TRISA3
#define S4_in_LAT                  LATAbits.LATA3
#define S4_in_PORT                 PORTAbits.RA3
#define S4_in_WPU                  WPUAbits.WPUA3
#define S4_in_OD                   ODCONAbits.ODCA3
#define S4_in_ANS                  ANSELAbits.ANSELA3
#define S4_in_SetHigh()            do { LATAbits.LATA3 = 1; } while(0)
#define S4_in_SetLow()             do { LATAbits.LATA3 = 0; } while(0)
#define S4_in_Toggle()             do { LATAbits.LATA3 = ~LATAbits.LATA3; } while(0)
#define S4_in_GetValue()           PORTAbits.RA3
#define S4_in_SetDigitalInput()    do { TRISAbits.TRISA3 = 1; } while(0)
#define S4_in_SetDigitalOutput()   do { TRISAbits.TRISA3 = 0; } while(0)
#define S4_in_SetPullup()          do { WPUAbits.WPUA3 = 1; } while(0)
#define S4_in_ResetPullup()        do { WPUAbits.WPUA3 = 0; } while(0)
#define S4_in_SetPushPull()        do { ODCONAbits.ODCA3 = 0; } while(0)
#define S4_in_SetOpenDrain()       do { ODCONAbits.ODCA3 = 1; } while(0)
#define S4_in_SetAnalogMode()      do { ANSELAbits.ANSELA3 = 1; } while(0)
#define S4_in_SetDigitalMode()     do { ANSELAbits.ANSELA3 = 0; } while(0)

// get/set S5_in aliases
#define S5_in_TRIS                 TRISAbits.TRISA4
#define S5_in_LAT                  LATAbits.LATA4
#define S5_in_PORT                 PORTAbits.RA4
#define S5_in_WPU                  WPUAbits.WPUA4
#define S5_in_OD                   ODCONAbits.ODCA4
#define S5_in_ANS                  ANSELAbits.ANSELA4
#define S5_in_SetHigh()            do { LATAbits.LATA4 = 1; } while(0)
#define S5_in_SetLow()             do { LATAbits.LATA4 = 0; } while(0)
#define S5_in_Toggle()             do { LATAbits.LATA4 = ~LATAbits.LATA4; } while(0)
#define S5_in_GetValue()           PORTAbits.RA4
#define S5_in_SetDigitalInput()    do { TRISAbits.TRISA4 = 1; } while(0)
#define S5_in_SetDigitalOutput()   do { TRISAbits.TRISA4 = 0; } while(0)
#define S5_in_SetPullup()          do { WPUAbits.WPUA4 = 1; } while(0)
#define S5_in_ResetPullup()        do { WPUAbits.WPUA4 = 0; } while(0)
#define S5_in_SetPushPull()        do { ODCONAbits.ODCA4 = 0; } while(0)
#define S5_in_SetOpenDrain()       do { ODCONAbits.ODCA4 = 1; } while(0)
#define S5_in_SetAnalogMode()      do { ANSELAbits.ANSELA4 = 1; } while(0)
#define S5_in_SetDigitalMode()     do { ANSELAbits.ANSELA4 = 0; } while(0)

// get/set S6_in aliases
#define S6_in_TRIS                 TRISAbits.TRISA5
#define S6_in_LAT                  LATAbits.LATA5
#define S6_in_PORT                 PORTAbits.RA5
#define S6_in_WPU                  WPUAbits.WPUA5
#define S6_in_OD                   ODCONAbits.ODCA5
#define S6_in_ANS                  ANSELAbits.ANSELA5
#define S6_in_SetHigh()            do { LATAbits.LATA5 = 1; } while(0)
#define S6_in_SetLow()             do { LATAbits.LATA5 = 0; } while(0)
#define S6_in_Toggle()             do { LATAbits.LATA5 = ~LATAbits.LATA5; } while(0)
#define S6_in_GetValue()           PORTAbits.RA5
#define S6_in_SetDigitalInput()    do { TRISAbits.TRISA5 = 1; } while(0)
#define S6_in_SetDigitalOutput()   do { TRISAbits.TRISA5 = 0; } while(0)
#define S6_in_SetPullup()          do { WPUAbits.WPUA5 = 1; } while(0)
#define S6_in_ResetPullup()        do { WPUAbits.WPUA5 = 0; } while(0)
#define S6_in_SetPushPull()        do { ODCONAbits.ODCA5 = 0; } while(0)
#define S6_in_SetOpenDrain()       do { ODCONAbits.ODCA5 = 1; } while(0)
#define S6_in_SetAnalogMode()      do { ANSELAbits.ANSELA5 = 1; } while(0)
#define S6_in_SetDigitalMode()     do { ANSELAbits.ANSELA5 = 0; } while(0)

