jminor717/Teensy-Coil-Gun/V3/PIC18F45_CoilGunController.X/mcc_generated_files/pin_manager.h
// get/set RB4 procedures
#define RB4_SetHigh()            do { LATBbits.LATB4 = 1; } while(0)
#define RB4_SetLow()             do { LATBbits.LATB4 = 0; } while(0)
#define RB4_Toggle()             do { LATBbits.LATB4 = ~LATBbits.LATB4; } while(0)
#define RB4_GetValue()              PORTBbits.RB4
#define RB4_SetDigitalInput()    do { TRISBbits.TRISB4 = 1; } while(0)
#define RB4_SetDigitalOutput()   do { TRISBbits.TRISB4 = 0; } while(0)
#define RB4_SetPullup()             do { WPUBbits.WPUB4 = 1; } while(0)
#define RB4_ResetPullup()           do { WPUBbits.WPUB4 = 0; } while(0)
#define RB4_SetAnalogMode()         do { ANSELBbits.ANSELB4 = 1; } while(0)
#define RB4_SetDigitalMode()        do { ANSELBbits.ANSELB4 = 0; } while(0)

// get/set RB5 procedures
#define RB5_SetHigh()            do { LATBbits.LATB5 = 1; } while(0)
#define RB5_SetLow()             do { LATBbits.LATB5 = 0; } while(0)
#define RB5_Toggle()             do { LATBbits.LATB5 = ~LATBbits.LATB5; } while(0)
#define RB5_GetValue()              PORTBbits.RB5
#define RB5_SetDigitalInput()    do { TRISBbits.TRISB5 = 1; } while(0)
#define RB5_SetDigitalOutput()   do { TRISBbits.TRISB5 = 0; } while(0)
#define RB5_SetPullup()             do { WPUBbits.WPUB5 = 1; } while(0)
#define RB5_ResetPullup()           do { WPUBbits.WPUB5 = 0; } while(0)
#define RB5_SetAnalogMode()         do { ANSELBbits.ANSELB5 = 1; } while(0)
#define RB5_SetDigitalMode()        do { ANSELBbits.ANSELB5 = 0; } while(0)

// get/set S10_in aliases
#define S10_in_TRIS                 TRISCbits.TRISC0
#define S10_in_LAT                  LATCbits.LATC0
#define S10_in_PORT                 PORTCbits.RC0
#define S10_in_WPU                  WPUCbits.WPUC0
#define S10_in_OD                   ODCONCbits.ODCC0
#define S10_in_ANS                  ANSELCbits.ANSELC0
#define S10_in_SetHigh()            do { LATCbits.LATC0 = 1; } while(0)
#define S10_in_SetLow()             do { LATCbits.LATC0 = 0; } while(0)
#define S10_in_Toggle()             do { LATCbits.LATC0 = ~LATCbits.LATC0; } while(0)
#define S10_in_GetValue()           PORTCbits.RC0
#define S10_in_SetDigitalInput()    do { TRISCbits.TRISC0 = 1; } while(0)
#define S10_in_SetDigitalOutput()   do { TRISCbits.TRISC0 = 0; } while(0)
#define S10_in_SetPullup()          do { WPUCbits.WPUC0 = 1; } while(0)
#define S10_in_ResetPullup()        do { WPUCbits.WPUC0 = 0; } while(0)
#define S10_in_SetPushPull()        do { ODCONCbits.ODCC0 = 0; } while(0)
#define S10_in_SetOpenDrain()       do { ODCONCbits.ODCC0 = 1; } while(0)
#define S10_in_SetAnalogMode()      do { ANSELCbits.ANSELC0 = 1; } while(0)
#define S10_in_SetDigitalMode()     do { ANSELCbits.ANSELC0 = 0; } while(0)

// get/set S11_in aliases
#define S11_in_TRIS                 TRISCbits.TRISC1
#define S11_in_LAT                  LATCbits.LATC1
#define S11_in_PORT                 PORTCbits.RC1
#define S11_in_WPU                  WPUCbits.WPUC1
#define S11_in_OD                   ODCONCbits.ODCC1
#define S11_in_ANS                  ANSELCbits.ANSELC1
#define S11_in_SetHigh()            do { LATCbits.LATC1 = 1; } while(0)
#define S11_in_SetLow()             do { LATCbits.LATC1 = 0; } while(0)
#define S11_in_Toggle()             do { LATCbits.LATC1 = ~LATCbits.LATC1; } while(0)
#define S11_in_GetValue()           PORTCbits.RC1
#define S11_in_SetDigitalInput()    do { TRISCbits.TRISC1 = 1; } while(0)
#define S11_in_SetDigitalOutput()   do { TRISCbits.TRISC1 = 0; } while(0)
#define S11_in_SetPullup()          do { WPUCbits.WPUC1 = 1; } while(0)
#define S11_in_ResetPullup()        do { WPUCbits.WPUC1 = 0; } while(0)
#define S11_in_SetPushPull()        do { ODCONCbits.ODCC1 = 0; } while(0)
#define S11_in_SetOpenDrain()       do { ODCONCbits.ODCC1 = 1; } while(0)
#define S11_in_SetAnalogMode()      do { ANSELCbits.ANSELC1 = 1; } while(0)
#define S11_in_SetDigitalMode()     do { ANSELCbits.ANSELC1 = 0; } while(0)

// get/set Fire_Start aliases
#define Fire_Start_TRIS                 TRISCbits.TRISC3
#define Fire_Start_LAT                  LATCbits.LATC3
#define Fire_Start_PORT                 PORTCbits.RC3
#define Fire_Start_WPU                  WPUCbits.WPUC3
#define Fire_Start_OD                   ODCONCbits.ODCC3
#define Fire_Start_ANS                  ANSELCbits.ANSELC3
#define Fire_Start_SetHigh()            do { LATCbits.LATC3 = 1; } while(0)
#define Fire_Start_SetLow()             do { LATCbits.LATC3 = 0; } while(0)
#define Fire_Start_Toggle()             do { LATCbits.LATC3 = ~LATCbits.LATC3; } while(0)
#define Fire_Start_GetValue()           PORTCbits.RC3
#define Fire_Start_SetDigitalInput()    do { TRISCbits.TRISC3 = 1; } while(0)
#define Fire_Start_SetDigitalOutput()   do { TRISCbits.TRISC3 = 0; } while(0)
#define Fire_Start_SetPullup()          do { WPUCbits.WPUC3 = 1; } while(0)
#define Fire_Start_ResetPullup()        do { WPUCbits.WPUC3 = 0; } while(0)
#define Fire_Start_SetPushPull()        do { ODCONCbits.ODCC3 = 0; } while(0)
#define Fire_Start_SetOpenDrain()       do { ODCONCbits.ODCC3 = 1; } while(0)
#define Fire_Start_SetAnalogMode()      do { ANSELCbits.ANSELC3 = 1; } while(0)
#define Fire_Start_SetDigitalMode()     do { ANSELCbits.ANSELC3 = 0; } while(0)

// get/set Trigger_in aliases
#define Trigger_in_TRIS                 TRISCbits.TRISC6
#define Trigger_in_LAT                  LATCbits.LATC6
#define Trigger_in_PORT                 PORTCbits.RC6
#define Trigger_in_WPU                  WPUCbits.WPUC6
#define Trigger_in_OD                   ODCONCbits.ODCC6
#define Trigger_in_ANS                  ANSELCbits.ANSELC6
#define Trigger_in_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define Trigger_in_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define Trigger_in_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define Trigger_in_GetValue()           PORTCbits.RC6
#define Trigger_in_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define Trigger_in_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define Trigger_in_SetPullup()          do { WPUCbits.WPUC6 = 1; } while(0)
#define Trigger_in_ResetPullup()        do { WPUCbits.WPUC6 = 0; } while(0)
#define Trigger_in_SetPushPull()        do { ODCONCbits.ODCC6 = 0; } while(0)
#define Trigger_in_SetOpenDrain()       do { ODCONCbits.ODCC6 = 1; } while(0)
#define Trigger_in_SetAnalogMode()      do { ANSELCbits.ANSELC6 = 1; } while(0)
#define Trigger_in_SetDigitalMode()     do { ANSELCbits.ANSELC6 = 0; } while(0)

// get/set Safety_in aliases
#define Safety_in_TRIS                 TRISCbits.TRISC7
#define Safety_in_LAT                  LATCbits.LATC7
#define Safety_in_PORT                 PORTCbits.RC7
#define Safety_in_WPU                  WPUCbits.WPUC7
#define Safety_in_OD                   ODCONCbits.ODCC7
#define Safety_in_ANS                  ANSELCbits.ANSELC7
#define Safety_in_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define Safety_in_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define Safety_in_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define Safety_in_GetValue()           PORTCbits.RC7
#define Safety_in_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define Safety_in_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define Safety_in_SetPullup()          do { WPUCbits.WPUC7 = 1; } while(0)
#define Safety_in_ResetPullup()        do { WPUCbits.WPUC7 = 0; } while(0)
#define Safety_in_SetPushPull()        do { ODCONCbits.ODCC7 = 0; } while(0)
#define Safety_in_SetOpenDrain()       do { ODCONCbits.ODCC7 = 1; } while(0)
#define Safety_in_SetAnalogMode()      do { ANSELCbits.ANSELC7 = 1; } while(0)
#define Safety_in_SetDigitalMode()     do { ANSELCbits.ANSELC7 = 0; } while(0)

// get/set C1_L aliases
#define C1_L_TRIS                 TRISDbits.TRISD0
#define C1_L_LAT                  LATDbits.LATD0
#define C1_L_PORT                 PORTDbits.RD0
#define C1_L_WPU                  WPUDbits.WPUD0
#define C1_L_OD                   ODCONDbits.ODCD0
#define C1_L_ANS                  ANSELDbits.ANSELD0
#define C1_L_SetHigh()            do { LATDbits.LATD0 = 1; } while(0)
#define C1_L_SetLow()             do { LATDbits.LATD0 = 0; } while(0)
#define C1_L_Toggle()             do { LATDbits.LATD0 = ~LATDbits.LATD0; } while(0)
#define C1_L_GetValue()           PORTDbits.RD0
#define C1_L_SetDigitalInput()    do { TRISDbits.TRISD0 = 1; } while(0)
#define C1_L_SetDigitalOutput()   do { TRISDbits.TRISD0 = 0; } while(0)
#define C1_L_SetPullup()          do { WPUDbits.WPUD0 = 1; } while(0)
#define C1_L_ResetPullup()        do { WPUDbits.WPUD0 = 0; } while(0)
#define C1_L_SetPushPull()        do { ODCONDbits.ODCD0 = 0; } while(0)
#define C1_L_SetOpenDrain()       do { ODCONDbits.ODCD0 = 1; } while(0)
#define C1_L_SetAnalogMode()      do { ANSELDbits.ANSELD0 = 1; } while(0)
#define C1_L_SetDigitalMode()     do { ANSELDbits.ANSELD0 = 0; } while(0)

// get/set C1_H aliases
#define C1_H_TRIS                 TRISDbits.TRISD1
#define C1_H_LAT                  LATDbits.LATD1
#define C1_H_PORT                 PORTDbits.RD1
#define C1_H_WPU                  WPUDbits.WPUD1
#define C1_H_OD                   ODCONDbits.ODCD1
#define C1_H_ANS                  ANSELDbits.ANSELD1
#define C1_H_SetHigh()            do { LATDbits.LATD1 = 1; } while(0)
#define C1_H_SetLow()             do { LATDbits.LATD1 = 0; } while(0)
#define C1_H_Toggle()             do { LATDbits.LATD1 = ~LATDbits.LATD1; } while(0)
#define C1_H_GetValue()           PORTDbits.RD1
#define C1_H_SetDigitalInput()    do { TRISDbits.TRISD1 = 1; } while(0)
#define C1_H_SetDigitalOutput()   do { TRISDbits.TRISD1 = 0; } while(0)
#define C1_H_SetPullup()          do { WPUDbits.WPUD1 = 1; } while(0)
#define C1_H_ResetPullup()        do { WPUDbits.WPUD1 = 0; } while(0)
#define C1_H_SetPushPull()        do { ODCONDbits.ODCD1 = 0; } while(0)
#define C1_H_SetOpenDrain()       do { ODCONDbits.ODCD1 = 1; } while(0)
#define C1_H_SetAnalogMode()      do { ANSELDbits.ANSELD1 = 1; } while(0)
#define C1_H_SetDigitalMode()     do { ANSELDbits.ANSELD1 = 0; } while(0)

